; domain
(define (domain problem1)

    (:requirements :strips :typing)

    (:types
        location
        workstation
        robot
        box
        content
    )

    (:constants
        central_warehouse - location
    )

    (:predicates
        (adjacent ?l1 - location ?l2 - location)
        (robot_at_location ?r - robot ?l - location)
        (box_at_location ?b - box ?l - location)
        (content_at_workstation_at_location ?c - content ?w - workstation ?l - location)
        (workstation_at_location ?w - workstation ?l - location)
        
        (box_has_content ?b - box ?c - content)
        (robot_has_box ?r - robot ?b - box)
        
        ; predicates for simpler preconditions and effects, and also redundancy
        (robot_is_carrying ?r - robot)
        (box_is_being_carried ?b - box)
        (box_is_full ?b - box)

        (content_at_cw ?c - content) ; to implement infinite content availability
    )

    (:action move
        :parameters (
            ?r - robot
            ?from - location
            ?to - location
        )
        :precondition (and
            (robot_at_location ?r ?from)
            (adjacent ?from ?to)
        )
        :effect (and
            (not (robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action pick_up_box
        :parameters (
            ?r - robot
            ?b - box
            ?l - location
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (box_at_location ?b ?l)
            (not (robot_is_carrying ?r))
            (not (box_is_being_carried ?b))
        )
        :effect (and
            (not (box_at_location ?b ?l))
            (robot_has_box ?r ?b)
            (box_is_being_carried ?b)
            (robot_is_carrying ?r)
        )
    )

    (:action put_down_box
        :parameters (
            ?r - robot
            ?b - box
            ?l - location
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (robot_has_box ?r ?b)
            (box_is_being_carried ?b)
            (robot_is_carrying ?r)
        )
        :effect (and
            (not (robot_has_box ?r ?b))
            (box_at_location ?b ?l)
            (not (robot_is_carrying ?r))
            (not (box_is_being_carried ?b))
        )
    )

    (:action pick_up_content_at_cw
        :parameters (
            ?r - robot
            ?b - box
            ?c - content
        )
        :precondition (and
            (robot_at_location ?r central_warehouse)
            (robot_has_box ?r ?b)
            (robot_is_carrying ?r)
            (not (box_is_full ?b))
            (content_at_cw ?c)
        )
        :effect (and
            (box_has_content ?b ?c)
            (box_is_full ?b)
            ; content still remains at cw to implement infinite content availability
        )
    )

    (:action put_down_content_at_cw
        :parameters(
            ?r - robot
            ?b - box
            ?c - content
        )
        :precondition (and
            (robot_at_location ?r central_warehouse)
            (robot_has_box ?r ?b)
            (robot_is_carrying ?r)
            (box_is_full ?b)
            (box_has_content ?b ?c)
        )
        :effect (and
            (not (box_has_content ?b ?c))
            (not (box_is_full ?b))
        )
    )

    (:action pick_up_content
        :parameters (
            ?r - robot
            ?b - box
            ?c - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (robot_has_box ?r ?b)
            (robot_is_carrying ?r)
            (not (box_is_full ?b))
            (workstation_at_location ?w ?l)
            (content_at_workstation_at_location ?c ?w ?l)
        )
        :effect (and
            (box_has_content ?b ?c)
            (box_is_full ?b)
            (not (content_at_workstation_at_location ?c ?w ?l))
        )
    )

    (:action put_down_content
        :parameters (
            ?r - robot
            ?b - box
            ?c - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (robot_has_box ?r ?b)
            (robot_is_carrying ?r)
            (box_is_full ?b)
            (workstation_at_location ?w ?l)
            (box_has_content ?b ?c)
        )
        :effect (and
            (content_at_workstation_at_location ?c ?w ?l)
            (not (box_has_content ?b ?c))
            (not (box_is_full ?b))
        )
    )
)

; problem
(define (problem problem_4)
    (:domain problem1)

    (:objects
        loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 loc16 - location
        rob1 rob2 - robot
        box1 box2 - box
        wor1_1 wor2_1 wor3_1 wor4_1 wor5_1 wor6_1 wor7_1 wor8_1 wor9_1 wor10_1 wor11_1 wor12_1 wor13_1 wor14_1 wor15_1 wor16_1 - workstation
        tool valve bolt nut screw gears - content
    )

    (:init
        ; central_warehouse is adjacent to locations 1,2,3,4
        ; location 1 is adjacent to central_warehouse, 5,6,7
        ; location 2 is adjacent to central_warehouse, 8,9,10
        ; location 3 is adjacent to central_warehouse, 11,12,13
        ; location 4 is adjacent to central_warehouse, 14,15,16
        (adjacent central_warehouse loc1)
        (adjacent loc1 central_warehouse)
        (adjacent central_warehouse loc2)
        (adjacent loc2 central_warehouse)
        (adjacent central_warehouse loc3)
        (adjacent loc3 central_warehouse)
        (adjacent central_warehouse loc4)
        (adjacent loc4 central_warehouse)
        (adjacent loc1 loc5)
        (adjacent loc5 loc1)
        (adjacent loc1 loc6)
        (adjacent loc6 loc1)
        (adjacent loc1 loc7)
        (adjacent loc7 loc1)
        (adjacent loc2 loc8)
        (adjacent loc8 loc2)
        (adjacent loc2 loc9)
        (adjacent loc9 loc2)
        (adjacent loc2 loc10)
        (adjacent loc10 loc2)
        (adjacent loc3 loc11)
        (adjacent loc11 loc3)
        (adjacent loc3 loc12)
        (adjacent loc12 loc3)
        (adjacent loc3 loc13)
        (adjacent loc13 loc3)
        (adjacent loc4 loc14)
        (adjacent loc14 loc4)
        (adjacent loc4 loc15)
        (adjacent loc15 loc4)
        (adjacent loc4 loc16)
        (adjacent loc16 loc4)


        (robot_at_location rob1 central_warehouse)
        (robot_at_location rob2 central_warehouse)
        (box_at_location box1 central_warehouse)
        (box_at_location box2 central_warehouse)

        (content_at_cw tool)
        (content_at_cw valve)
        (content_at_cw bolt)
        (content_at_cw nut)
        (content_at_cw screw)
        (content_at_cw gears)

        (workstation_at_location wor1_1 loc1)
        (workstation_at_location wor2_1 loc2)
        (workstation_at_location wor3_1 loc3)
        (workstation_at_location wor4_1 loc4)
        (workstation_at_location wor5_1 loc5)
        (workstation_at_location wor6_1 loc6)
        (workstation_at_location wor7_1 loc7)
        (workstation_at_location wor8_1 loc8)
        (workstation_at_location wor9_1 loc9)
        (workstation_at_location wor10_1 loc10)
        (workstation_at_location wor11_1 loc11)
        (workstation_at_location wor12_1 loc12)
        (workstation_at_location wor13_1 loc13)
        (workstation_at_location wor14_1 loc14)
        (workstation_at_location wor15_1 loc15)
        (workstation_at_location wor16_1 loc16)
    )

    (:goal
        (and
            (content_at_workstation_at_location tool wor1_1 loc1)
            (content_at_workstation_at_location valve wor2_1 loc2)
            (content_at_workstation_at_location bolt wor3_1 loc3)
            (content_at_workstation_at_location nut wor4_1 loc4)
            (content_at_workstation_at_location screw wor5_1 loc5)
            (content_at_workstation_at_location gears wor6_1 loc6)
            (content_at_workstation_at_location tool wor7_1 loc7)
            (content_at_workstation_at_location valve wor8_1 loc8)
            (content_at_workstation_at_location bolt wor9_1 loc9)
            (content_at_workstation_at_location nut wor10_1 loc10)
            (content_at_workstation_at_location screw wor11_1 loc11)
            (content_at_workstation_at_location gears wor12_1 loc12)
            (content_at_workstation_at_location tool wor13_1 loc13)
            (content_at_workstation_at_location valve wor14_1 loc14)
            (content_at_workstation_at_location bolt wor15_1 loc15)
            (content_at_workstation_at_location nut wor16_1 loc16)
        )
    )
)

; plan
1. (pick_up_box rob2 box1 central_warehouse)
   deleted: (box_at_location box1 central_warehouse)
   added: (robot_has_box rob2 box1) (box_is_being_carried box1) (robot_is_carrying rob2)
   goals met: 0 of 16
2. (pick_up_content_at_cw rob2 box1 bolt)
   added: (box_has_content box1 bolt) (box_is_full box1)
   goals met: 0 of 16
3. (pick_up_box rob1 box2 central_warehouse)
   deleted: (box_at_location box2 central_warehouse)
   added: (robot_has_box rob1 box2) (box_is_being_carried box2) (robot_is_carrying rob1)
   goals met: 0 of 16
4. (pick_up_content_at_cw rob1 box2 nut)
   added: (box_has_content box2 nut) (box_is_full box2)
   goals met: 0 of 16
5. (move rob1 central_warehouse loc4)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc4)
   goals met: 0 of 16
6. (move rob1 loc4 loc16)
   deleted: (robot_at_location rob1 loc4)
   added: (robot_at_location rob1 loc16)
   goals met: 0 of 16
7. (put_down_content rob1 box2 nut loc16 wor16_1)
   deleted: (box_has_content box2 nut) (box_is_full box2)
   added: (content_at_workstation_at_location nut wor16_1 loc16)
   goals met: 1 of 16
8. (move rob1 loc16 loc4)
   deleted: (robot_at_location rob1 loc16)
   added: (robot_at_location rob1 loc4)
   goals met: 1 of 16
9. (move rob1 loc4 central_warehouse)
   deleted: (robot_at_location rob1 loc4)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 1 of 16
10. (pick_up_content_at_cw rob1 box2 tool)
   added: (box_has_content box2 tool) (box_is_full box2)
   goals met: 1 of 16
11. (move rob1 central_warehouse loc1)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc1)
   goals met: 1 of 16
12. (move rob1 loc1 loc7)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 loc7)
   goals met: 1 of 16
13. (put_down_content rob1 box2 tool loc7 wor7_1)
   deleted: (box_has_content box2 tool) (box_is_full box2)
   added: (content_at_workstation_at_location tool wor7_1 loc7)
   goals met: 2 of 16
14. (move rob1 loc7 loc1)
   deleted: (robot_at_location rob1 loc7)
   added: (robot_at_location rob1 loc1)
   goals met: 2 of 16
15. (move rob1 loc1 central_warehouse)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 2 of 16
16. (pick_up_content_at_cw rob1 box2 valve)
   added: (box_has_content box2 valve) (box_is_full box2)
   goals met: 2 of 16
17. (move rob1 central_warehouse loc2)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc2)
   goals met: 2 of 16
18. (move rob1 loc2 loc8)
   deleted: (robot_at_location rob1 loc2)
   added: (robot_at_location rob1 loc8)
   goals met: 2 of 16
19. (put_down_content rob1 box2 valve loc8 wor8_1)
   deleted: (box_has_content box2 valve) (box_is_full box2)
   added: (content_at_workstation_at_location valve wor8_1 loc8)
   goals met: 3 of 16
20. (move rob1 loc8 loc2)
   deleted: (robot_at_location rob1 loc8)
   added: (robot_at_location rob1 loc2)
   goals met: 3 of 16
21. (move rob1 loc2 central_warehouse)
   deleted: (robot_at_location rob1 loc2)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 3 of 16
22. (pick_up_content_at_cw rob1 box2 gears)
   added: (box_has_content box2 gears) (box_is_full box2)
   goals met: 3 of 16
23. (move rob1 central_warehouse loc1)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc1)
   goals met: 3 of 16
24. (move rob1 loc1 loc6)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 loc6)
   goals met: 3 of 16
25. (put_down_content rob1 box2 gears loc6 wor6_1)
   deleted: (box_has_content box2 gears) (box_is_full box2)
   added: (content_at_workstation_at_location gears wor6_1 loc6)
   goals met: 4 of 16
26. (move rob1 loc6 loc1)
   deleted: (robot_at_location rob1 loc6)
   added: (robot_at_location rob1 loc1)
   goals met: 4 of 16
27. (move rob1 loc1 central_warehouse)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 4 of 16
28. (pick_up_content_at_cw rob1 box2 nut)
   added: (box_has_content box2 nut) (box_is_full box2)
   goals met: 4 of 16
29. (move rob1 central_warehouse loc2)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc2)
   goals met: 4 of 16
30. (move rob1 loc2 loc10)
   deleted: (robot_at_location rob1 loc2)
   added: (robot_at_location rob1 loc10)
   goals met: 4 of 16
31. (put_down_content rob1 box2 nut loc10 wor10_1)
   deleted: (box_has_content box2 nut) (box_is_full box2)
   added: (content_at_workstation_at_location nut wor10_1 loc10)
   goals met: 5 of 16
32. (move rob1 loc10 loc2)
   deleted: (robot_at_location rob1 loc10)
   added: (robot_at_location rob1 loc2)
   goals met: 5 of 16
33. (move rob1 loc2 central_warehouse)
   deleted: (robot_at_location rob1 loc2)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 5 of 16
34. (pick_up_content_at_cw rob1 box2 screw)
   added: (box_has_content box2 screw) (box_is_full box2)
   goals met: 5 of 16
35. (move rob1 central_warehouse loc1)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc1)
   goals met: 5 of 16
36. (move rob1 loc1 loc5)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 loc5)
   goals met: 5 of 16
37. (put_down_content rob1 box2 screw loc5 wor5_1)
   deleted: (box_has_content box2 screw) (box_is_full box2)
   added: (content_at_workstation_at_location screw wor5_1 loc5)
   goals met: 6 of 16
38. (move rob1 loc5 loc1)
   deleted: (robot_at_location rob1 loc5)
   added: (robot_at_location rob1 loc1)
   goals met: 6 of 16
39. (move rob1 loc1 central_warehouse)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 6 of 16
40. (pick_up_content_at_cw rob1 box2 tool)
   added: (box_has_content box2 tool) (box_is_full box2)
   goals met: 6 of 16
41. (move rob1 central_warehouse loc3)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc3)
   goals met: 6 of 16
42. (move rob1 loc3 loc13)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 loc13)
   goals met: 6 of 16
43. (put_down_content rob1 box2 tool loc13 wor13_1)
   deleted: (box_has_content box2 tool) (box_is_full box2)
   added: (content_at_workstation_at_location tool wor13_1 loc13)
   goals met: 7 of 16
44. (move rob1 loc13 loc3)
   deleted: (robot_at_location rob1 loc13)
   added: (robot_at_location rob1 loc3)
   goals met: 7 of 16
45. (move rob1 loc3 central_warehouse)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 7 of 16
46. (pick_up_content_at_cw rob1 box2 valve)
   added: (box_has_content box2 valve) (box_is_full box2)
   goals met: 7 of 16
47. (move rob1 central_warehouse loc4)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc4)
   goals met: 7 of 16
48. (move rob1 loc4 loc14)
   deleted: (robot_at_location rob1 loc4)
   added: (robot_at_location rob1 loc14)
   goals met: 7 of 16
49. (put_down_content rob1 box2 valve loc14 wor14_1)
   deleted: (box_has_content box2 valve) (box_is_full box2)
   added: (content_at_workstation_at_location valve wor14_1 loc14)
   goals met: 8 of 16
50. (move rob1 loc14 loc4)
   deleted: (robot_at_location rob1 loc14)
   added: (robot_at_location rob1 loc4)
   goals met: 8 of 16
51. (move rob1 loc4 central_warehouse)
   deleted: (robot_at_location rob1 loc4)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 8 of 16
52. (pick_up_content_at_cw rob1 box2 gears)
   added: (box_has_content box2 gears) (box_is_full box2)
   goals met: 8 of 16
53. (move rob1 central_warehouse loc3)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc3)
   goals met: 8 of 16
54. (move rob1 loc3 loc12)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 loc12)
   goals met: 8 of 16
55. (put_down_content rob1 box2 gears loc12 wor12_1)
   deleted: (box_has_content box2 gears) (box_is_full box2)
   added: (content_at_workstation_at_location gears wor12_1 loc12)
   goals met: 9 of 16
56. (move rob1 loc12 loc3)
   deleted: (robot_at_location rob1 loc12)
   added: (robot_at_location rob1 loc3)
   goals met: 9 of 16
57. (move rob1 loc3 central_warehouse)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 9 of 16
58. (pick_up_content_at_cw rob1 box2 nut)
   added: (box_has_content box2 nut) (box_is_full box2)
   goals met: 9 of 16
59. (move rob1 central_warehouse loc4)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc4)
   goals met: 9 of 16
60. (put_down_content rob1 box2 nut loc4 wor4_1)
   deleted: (box_has_content box2 nut) (box_is_full box2)
   added: (content_at_workstation_at_location nut wor4_1 loc4)
   goals met: 10 of 16
61. (move rob1 loc4 central_warehouse)
   deleted: (robot_at_location rob1 loc4)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 10 of 16
62. (pick_up_content_at_cw rob1 box2 screw)
   added: (box_has_content box2 screw) (box_is_full box2)
   goals met: 10 of 16
63. (move rob1 central_warehouse loc3)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc3)
   goals met: 10 of 16
64. (move rob1 loc3 loc11)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 loc11)
   goals met: 10 of 16
65. (put_down_content rob1 box2 screw loc11 wor11_1)
   deleted: (box_has_content box2 screw) (box_is_full box2)
   added: (content_at_workstation_at_location screw wor11_1 loc11)
   goals met: 11 of 16
66. (move rob1 loc11 loc3)
   deleted: (robot_at_location rob1 loc11)
   added: (robot_at_location rob1 loc3)
   goals met: 11 of 16
67. (move rob1 loc3 central_warehouse)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 11 of 16
68. (pick_up_content_at_cw rob1 box2 tool)
   added: (box_has_content box2 tool) (box_is_full box2)
   goals met: 11 of 16
69. (move rob1 central_warehouse loc1)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc1)
   goals met: 11 of 16
70. (put_down_content rob1 box2 tool loc1 wor1_1)
   deleted: (box_has_content box2 tool) (box_is_full box2)
   added: (content_at_workstation_at_location tool wor1_1 loc1)
   goals met: 12 of 16
71. (move rob1 loc1 central_warehouse)
   deleted: (robot_at_location rob1 loc1)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 12 of 16
72. (pick_up_content_at_cw rob1 box2 valve)
   added: (box_has_content box2 valve) (box_is_full box2)
   goals met: 12 of 16
73. (move rob1 central_warehouse loc2)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc2)
   goals met: 12 of 16
74. (put_down_content rob1 box2 valve loc2 wor2_1)
   deleted: (box_has_content box2 valve) (box_is_full box2)
   added: (content_at_workstation_at_location valve wor2_1 loc2)
   goals met: 13 of 16
75. (move rob1 loc2 central_warehouse)
   deleted: (robot_at_location rob1 loc2)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 13 of 16
76. (move rob2 central_warehouse loc2)
   deleted: (robot_at_location rob2 central_warehouse)
   added: (robot_at_location rob2 loc2)
   goals met: 13 of 16
77. (pick_up_content_at_cw rob1 box2 bolt)
   added: (box_has_content box2 bolt) (box_is_full box2)
   goals met: 13 of 16
78. (move rob2 loc2 loc9)
   deleted: (robot_at_location rob2 loc2)
   added: (robot_at_location rob2 loc9)
   goals met: 13 of 16
79. (put_down_content rob2 box1 bolt loc9 wor9_1)
   deleted: (box_has_content box1 bolt) (box_is_full box1)
   added: (content_at_workstation_at_location bolt wor9_1 loc9)
   goals met: 14 of 16
80. (move rob1 central_warehouse loc3)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc3)
   goals met: 14 of 16
81. (put_down_content rob1 box2 bolt loc3 wor3_1)
   deleted: (box_has_content box2 bolt) (box_is_full box2)
   added: (content_at_workstation_at_location bolt wor3_1 loc3)
   goals met: 15 of 16
82. (move rob1 loc3 central_warehouse)
   deleted: (robot_at_location rob1 loc3)
   added: (robot_at_location rob1 central_warehouse)
   goals met: 15 of 16
83. (pick_up_content_at_cw rob1 box2 bolt)
   added: (box_has_content box2 bolt) (box_is_full box2)
   goals met: 15 of 16
84. (move rob1 central_warehouse loc4)
   deleted: (robot_at_location rob1 central_warehouse)
   added: (robot_at_location rob1 loc4)
   goals met: 15 of 16
85. (move rob1 loc4 loc15)
   deleted: (robot_at_location rob1 loc4)
   added: (robot_at_location rob1 loc15)
   goals met: 15 of 16
86. (put_down_content rob1 box2 bolt loc15 wor15_1)
   deleted: (box_has_content box2 bolt) (box_is_full box2)
   added: (content_at_workstation_at_location bolt wor15_1 loc15)
   goals met: 16 of 16
